alKallergis/CC3200-1-Axis-gyro-w-telemetry-UDP/USR 1-Axis gyro with telemetry udp VOLTAGE/main.c
//Copyright (c) 2018 Alex Kallergis

/*This program receives 2 input servo channels(coming from a RC receiver) and outputs a servo channel controlled by a PD loop.
 * The timers are 24-bit PWM. TimerA2A is the input signal from the receiver. The timerA2B input determines the gains Kp & Kd of the control system.
 * When this channel's pulse is bigger than ~1.06ms,the gains are proportional to the pulse width. When it is smaller,the receiver signal(A2A) is
 * passed straight to the output.
 * An ITG-3205 gyroscope sensor is interfaced via i2c and set to work @ 1KHZ with a 42HZ LPF.
 * When the control works,the output channel is the output of a closed loop system where the error is the TimerA2A input signal
 * converted to degrees/second,minus the gyroscope z axis detected rate which is also in degrees/sec.
 * With a considered pulse width of 1-2ms and a period 20ms,the conversion is arbitrarily set to -500deg/s for 1ms and 500 deg/s for 2ms.
 * Note that any inputs and outputs outside the 1-2ms bounds are brought back to bounds.
 *
 * An ADC is also used with interrupts to calculate an onboard voltage.
 * This cc3200 also an AP open where one can connect and receive the UDP packets with the telemetry.The packets
 * are sent every transmissionPeriodPrescale times a positive edge is detected from the input channel.

Signals:
    P60-ADC INPUT. notice it mut be lower than 1,4v
    P03-I2C SCL to ITG-3205
    P04-I2C SDA to ITG-3205
    P15-TIMERA2A
    P05-TIMERA2B
    P01-Output signal
    P02-Output signal(Conjucate of P01)
*/

// Standard includes
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

// simplelink includes
#include "simplelink.h"
#include "wlan.h"

// driverlib includes
#include "hw_ints.h"
#include "hw_types.h"
#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "rom.h"
#include "rom_map.h"
#include "interrupt.h"
#include "prcm.h"
#include "utils.h"
#include "uart.h"
#include "hw_adc.h"
#include "adc.h"
#include <inttypes.h>
#include "timer.h"
#include "timer_if.h"
// common interface includes
#include "i2c_if.h"
#include "common.h"
#include "pin_mux_config.h"


#ifndef NOTERM
#include "uart_if.h"
#endif

#include "pin_mux_config.h"

#define PORT_NUM           5001
#define BUF_SIZE           128

#define UART_PRINT              Report
#define FOREVER                 1
#define CONSOLE                 UARTA0_BASE
#define FAILURE                 -1
#define SUCCESS                 0
#define RETERR_IF_TRUE(condition) {if(condition) return FAILURE;}
#define RET_IF_ERR(Func)          {int iRetVal = (Func); \
                                   if (SUCCESS != iRetVal) \
                                     return  iRetVal;}
#define Period_ticks 0x186a00   //TimerA2 ticks for a 20ms period
#define TICKS_FOR_3MS   240000  //need this to define a valid pulse
#define TICKS_FOR_1point5MS   120000
#define TICKS_FOR_CONTROL_ENABLE   93000
#define START_TICKS 85000

// Application specific status/error codes
typedef enum{
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    SOCKET_CREATE_ERROR = -0x7D0,
    BIND_ERROR = SOCKET_CREATE_ERROR - 1,
    SEND_ERROR = BIND_ERROR - 1,
    RECV_ERROR = SEND_ERROR -1,
    SOCKET_CLOSE = RECV_ERROR -1,  
    DEVICE_NOT_IN_STATION_MODE = SOCKET_CLOSE - 1,
    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;



//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************
static void BoardInit();
static void InitializeAppVariables();
static long ConfigureSimpleLinkToDefaultState();
int IpAddressParser(char *ucCMD);
void UDPTRANSMITSETUP(unsigned short usPort);
void UDPTRANSMIT(void);
float tdif(unsigned long int m);
void i2csetupAndTest(void);
void readI2Crates(void);
void calculatecoefficients(void);
void TimA2AIntHandler(void);
void TimA2BIntHandler(void);
void configTA2(void);
void configTA3(void);
void myUartReport(void);
void adcSetup(void);

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long  g_ulStatus,temp;//SimpleLink Status
unsigned long  g_ulStaIp;
unsigned long  g_ulPingPacketsRecv;
unsigned long  g_uiGatewayIP;
unsigned long  DestIp;        //dest IP address
unsigned long g_ulDestinationIp;
unsigned int   g_uiPortNum = PORT_NUM;
unsigned long  g_ulIpAddr,x,lLoopCount;
unsigned char g_cBsdBuf[BUF_SIZE],temp2[8];
short sTestBufLen;
int iRetVal,NODATA,dataavailable,transmissionPeriodPrescale=10;;
unsigned char ucDHCP;
long lRetVal = -1,lNonBlocking = 1,intenabled;
float ms,ms1,ms2,y,xrate[2],yrate[2],zrate[2],indeg[2],outMatchDeg;
double xerr,yerr,zerr,xcumul,ycumul,zcumul;
double lamda1,lamda2,beta1,beta2;   //coefficients
double P,D,Kp,Kd,outmatchdeg;
unsigned int i[2],m,c,n,samplesA[2],samplesB[2],invalid_pulses,valid_pulses;
unsigned int waiting,udpSendCounter,valAdc;
long int outmatch=Period_ticks-START_TICKS;//initial match value for outmatch,close to edge
unsigned int L,H,intTest;
tBoolean above,rdy,coeffrdy;
SlSockAddrIn_t  sAddr;
tBoolean withinLoop;
tBoolean insideInt;
unsigned const char itg3205addr=0x68;
unsigned const char WHO_AM_I = 0x00;
unsigned const char SMPLRT_DIV_addr=0x15;
unsigned const char SMPLRT_DIV_conf=0x00;
unsigned const char GYRO_DPLF_ADDR = 0x16;
unsigned const char GYRO_DPLF_CONF = 0x1B;  //11011 1KHZ,42HZ LPF
unsigned const char INT_CONF_ADDR = 0x17;
unsigned const char INT_CONF_CONF = 0b00100101; //LATCH_INT_EN,ITG_RDY_EN,RAW_RDY_EN
unsigned const char INT_STATUS_ADDR = 0x1A;
unsigned const char gyro_x_h=0X1D;  //reg address
_i8 i2cbuf[10],drdy; //for some reason char or unsigned char wont work
unsigned char settingsbuf[2];
int k,iStatus,iSockID,iAddrSize;

#if defined(ccs) || defined(gcc)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************


//*****************************************************************************
// SimpleLink Asynchronous Event Handlers -- Start
//*****************************************************************************


//*****************************************************************************
//
//! \brief The Function Handles WLAN Events
//!
//! \param[in]  pWlanEvent - Pointer to WLAN Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pSlWlanEvent)
{
    switch(pSlWlanEvent->Event)
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT(g_ulStatus, STATUS_BIT_CONNECTION);
            UART_PRINT("Wlan connection event \n\r");
            //
            // Information about the connected AP (like name, MAC etc) will be
            // available in 'slWlanConnectAsyncResponse_t'-Applications
            // can use it if required
            //
            //  slWlanConnectAsyncResponse_t *pEventData = NULL;
            // pEventData = &pWlanEvent->EventData.STAandP2PModeWlanConnected;
            //
            //
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t*  pEventData = NULL;

