alKallergis/CC3200-1-Axis-gyro-w-telemetry-UDP/USR 1-Axis gyro with telemetry udp VOLTAGE/main.c
    return lRetVal; // Success
}
//****************************************************************************
//
//! Confgiures the mode in which the device will work
//!
//! \param iMode is the current mode of the device
//!
//! This function
//!    1. prompt user for desired configuration and accordingly configure the
//!          networking mode(STA or AP).
//!       2. also give the user the option to configure the ssid name in case of
//!       AP mode.
//!
//! \return sl_start return value(int).
//
//****************************************************************************
static int ConfigureMode(int iMode)
{
    char    pcSsidName[33]="cctestAP";
    long   lRetVal = -1;
    _u8    channel=8;

    lRetVal = sl_WlanSetMode(ROLE_AP);
    ASSERT_ON_ERROR(lRetVal);

    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SSID, strlen(pcSsidName),
                            (unsigned char*)pcSsidName);
    ASSERT_ON_ERROR(lRetVal);
    //UART_PRINT("Device is configured in AP mode\n\r");
    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_CHANNEL, strlen(channel),     //set channel to 8
                            (unsigned char*)&channel);
    ASSERT_ON_ERROR(lRetVal);

    /* Restart Network processor */
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);

    // reset status bits
    CLR_STATUS_BIT_ALL(g_ulStatus);

    return sl_Start(NULL,NULL,NULL);
}


void UDPTRANSMITSETUP(unsigned short usPort)
{
    sTestBufLen  = BUF_SIZE;
    DestIp = g_uiGatewayIP & 0xffffff00;        // final program target is broadcast .255
    DestIp|=0xff;
    //filling the UDP server socket address
    sAddr.sin_family = SL_AF_INET;
    sAddr.sin_port = sl_Htons((unsigned short)usPort);
    sAddr.sin_addr.s_addr = sl_Htonl((unsigned int)DestIp);
    UART_PRINT("Default settings: SSID Name: %s, PORT = %d, "
                    "Destination IP: %d.%d.%d.%d\n\r",
                    SSID_NAME, g_uiPortNum,
                    SL_IPV4_BYTE(DestIp,3),
                    SL_IPV4_BYTE(DestIp,2),
                    SL_IPV4_BYTE(DestIp,1),
                    SL_IPV4_BYTE(DestIp,0));

    iAddrSize = sizeof(SlSockAddrIn_t);

    // creating a UDP socket
    iSockID = sl_Socket(SL_AF_INET,SL_SOCK_DGRAM, 0);
    if( iSockID < 0 )
    {
        // error
        ASSERT_ON_ERROR(SOCKET_CREATE_ERROR);
    }

    // setting socket option to make the socket as non blocking
    iStatus = sl_SetSockOpt(iSockID, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                            &lNonBlocking, sizeof(lNonBlocking));
    if (iStatus!=0){
        UART_PRINT("Couldn't set non-blocking!!\n\r");
    }

}

void UDPTRANSMIT(void){

    sprintf(g_cBsdBuf,"%1.2f V",(valAdc*1.466/4095.0));

        // sending packet
    iStatus = sl_SendTo(iSockID, g_cBsdBuf, sTestBufLen, 0,
                            (SlSockAddr_t *)&sAddr, iAddrSize);
    if (iStatus<0){
        if( iStatus == SL_EAGAIN ){
            UART_PRINT("eagain\n\r");   //TRY AGAIN..
            }
        else{
            UART_PRINT("error code:   %d\n\r",
                       iStatus);}
    }
    else{
        UART_PRINT("Sent message:   %s,\n\r",g_cBsdBuf);
    }
    #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask();
    #endif

    memset(g_cBsdBuf,0,sizeof(g_cBsdBuf));  //clear whole buffer.
    lLoopCount++;
    //UART_PRINT("Sent %u packets successfully\n\r",g_ulPacketCount);

}

void i2csetupAndTest(void){
    #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask();
    #endif

    while(I2C_IF_ReadFrom(itg3205addr,&WHO_AM_I,sizeof(WHO_AM_I),i2cbuf,1)<0);   //read whoami to confirm 0x68. loop if no connection.
    sprintf(settingsbuf,"%c%c",GYRO_DPLF_ADDR,GYRO_DPLF_CONF);
    I2C_IF_Write(itg3205addr,settingsbuf,2,1);      //write the dplf configuration

    sprintf(settingsbuf,"%c%c",SMPLRT_DIV_addr,SMPLRT_DIV_conf);
    I2C_IF_Write(itg3205addr,settingsbuf,2,1);      //write the sample rate configuration

    sprintf(settingsbuf,"%c%c",INT_CONF_ADDR,INT_CONF_CONF);
    I2C_IF_Write(itg3205addr,settingsbuf,2,1);      //write the INTERRUPT configuration


}

void readI2Crates(void){
    #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask();
    #endif
    I2C_IF_ReadFrom(itg3205addr,&INT_STATUS_ADDR,
                      sizeof(INT_STATUS_ADDR),&drdy,1);   // Find whether raw int status is asserted,it is cleared after it is read here
    if(!(drdy&1)){        //no data ready
      NODATA+=1;
      }
    else{
      dataavailable+=1;
      I2C_IF_ReadFrom(itg3205addr,&gyro_x_h,1,i2cbuf,6);      //READ GYRO REGISTERS
      xrate[0]=(i2cbuf[0]<<8|i2cbuf[1])/14.375-xerr;    //new values
      yrate[0]=(i2cbuf[2]<<8|i2cbuf[3])/14.375-yerr;
      zrate[0]=(i2cbuf[4]<<8|i2cbuf[5])/14.375-zerr;
      if (k<1000){        //these 11 lines are for calculating an average drift initially and then use it for compensation...
          k++;
          xcumul+=xrate[0];      //cumulative errors..
          ycumul+=yrate[0];
          zcumul+=zrate[0];
          if (k==1000){       //find average errors from the gyroscope and center value from receiver channel
              xerr=xcumul/1000.0;
              yerr=ycumul/1000.0;
              zerr=zcumul/1000.0;
              }
      }
    }
}

void calculatecoefficients(void){
    #ifndef SL_PLATFORM_MULTI_THREADED
                  _SlNonOsMainLoopTask();
    #endif
    while(!rdy){            //wait for 1st valid input pulse to be detected.
        waiting++;
        MAP_UtilsDelay(8000);  //100 us
    }
    //considering stick is centered so we proceed with calculating the coefficients as per notebook:
    m=i[0];
    lamda1=(m-80000.0)/40000;
    lamda2=(160000.0-m)/40000;
    beta1=80000-80000*lamda1;
    beta2=160000-160000*lamda2;
    coeffrdy=true;  //ready to make calculations of errors. otherwise divisions by 0 would occur
}

void TimA2AIntHandler(void){
//    if (GPIOPinRead(GPIOA0_BASE,GPIO_PIN_0)&0x1){ //CCP INPUT       //!! DOESN'T WORK
    while(insideInt==true); //trap. remove later
    insideInt=true; //keep track of when inside interrupts for testing purposes
    unsigned int temp; //temp value
    if (TimerIntStatus(TIMERA2_BASE,true)==TIMER_CAPA_EVENT){   //  has happened
        TimerIntClear(TIMERA2_BASE,TIMER_CAPA_EVENT);
        samplesA[1]=samplesA[0];
        samplesA[0]=TimerValueGet(TIMERA2_BASE, TIMER_A);
        temp=samplesA[1]-samplesA[0];
        if (temp<TICKS_FOR_3MS){   //be careful with wrap around arithmetic. here it won't work because the timers are 24,not 32-bit
            i[1]=i[0];  //shift fifo
            if(temp<80000){ //smaller than 1ms,need to correct
                    i[0]=80000;}//1ms
            else if (temp>160000){   //bigger than 2ms,need to correct
                i[0]=160000;    //2ms
            }
            else{
                i[0]=temp;}    //update input ticks array with new captured pulse
            if(coeffrdy&&above){   //if coefficients are ready &slider is above threshold,
                indeg[1]=indeg[0];
                //use the adjusted formula. this formula gives indeg=0 deg/s for y=m
                if(i[0]<=m){     //first part of the curve
                    indeg[0]=(i[0]-beta1)/lamda1/80-1500;}  //will this conversion to float work??
                else{   //2nd part of the curve
                    indeg[0]=(i[0]-beta2)/lamda2/80-1500;
                }
                zrate[1]=zrate[0];  //calculate new errors..
                P=Kp*(indeg[0]-zrate[0]);    //proportional term
                D=Kd*(indeg[0]-zrate[0]-indeg[1]+zrate[1])/40.0;   //differential
                outMatchDeg=P+D;
                outmatch=(outMatchDeg+1500)*80; //using the regular formula now
                myUartReport(); //monitor
            }
            else{   //just pass signal
                outmatch=i[0];
            }
            valid_pulses++;
            ms1=i[0]*12.5/1000000;  //input in milliseconds
            rdy=true;       //first result has been received
        }
        else{   //rising edge.change ta3match here as per notebook...
            if (outmatch<80000){outmatch=80000;}  //border the output..
            else if (outmatch>160000){outmatch=160000;}
            invalid_pulses++;   //this case was not a valid pos->neg pulse
            //create 2 conjugate/inverted signals:
            TimerMatchSet(TIMERA3_BASE, TIMER_A,((Period_ticks-outmatch)&0xffff));
            TimerPrescaleMatchSet(TIMERA3_BASE, TIMER_A,((Period_ticks-outmatch)&0xff0000)>>16);
            TimerMatchSet(TIMERA3_BASE, TIMER_B,(Period_ticks-TICKS_FOR_3MS+outmatch)&0xffff);
            TimerPrescaleMatchSet(TIMERA3_BASE, TIMER_B,((Period_ticks-TICKS_FOR_3MS+outmatch)&0xff0000)>>16);
            udpSendCounter++;   //count for knowing when to send packet
        }
        //L=HWREG(TIMERA2_BASE + TIMER_O_TAR);    //read LSBS of capture value as per datasheet. Actually captures all 32 bits.
                                                //Also, actually the TnR doesn't capture the edge ,and rolls along with TnV instead..
        //H=HWREG(TIMERA2_BASE + TIMER_O_TAPR);   //read MSBS -//-.. Doesn't work,is always read 255 here
    }
    insideInt=false;
}

void TimA2BIntHandler(void){
    while(insideInt==true); //trap. remove later
    insideInt=true; //keep track of when inside interrupts for testing purposes
    if (TimerIntStatus(TIMERA2_BASE,true)==TIMER_CAPB_EVENT){   //  has happened
        TimerIntClear(TIMERA2_BASE,TIMER_CAPB_EVENT);
        samplesB[1]=samplesB[0];
        samplesB[0]=TimerValueGet(TIMERA2_BASE, TIMER_B);
        if ((samplesB[1]-samplesB[0])<TICKS_FOR_3MS){   //be careful with wrap around arithmetic. here it won't work because the timers are 24,not 32-bit
            c=samplesB[1]-samplesB[0];
            ms2=c*12.5/1000000;  //in milliseconds
            if (c > TICKS_FOR_CONTROL_ENABLE){     //signal more than half,assert boolean
                above=true;
                Kp=10.0*(c-93000)/100000;
                Kd=30.0*(c-93000)/100000;
            }
            else{above=false;}
        }
    }
    insideInt=false;
}
void adint3(void)
{   ADCIntClear(ADC_BASE, ADC_CH_3,ADC_FIFO_FULL);
    //while(!ADCFIFOLvlGet(ADC_BASE, ADC_CH_3));    //no need
    valAdc = ADCFIFORead(ADC_BASE, ADC_CH_3) & 0x3FFF;
    valAdc = valAdc >> 2;

