alKallergis/CC3200-1-Axis-gyro-w-telemetry-UDP/USR 1-Axis gyro with telemetry udp VOLTAGE/main.c
}

void configTA2(void){
    Timer_IF_Init(PRCM_TIMERA2,TIMERA2_BASE,(TIMER_CFG_SPLIT_PAIR|TIMER_CFG_A_CAP_TIME|TIMER_CFG_B_CAP_TIME),
                  TIMER_BOTH,0xff); //TIMER0 A&B CAPTURE, T=209.7152 ms
    TimerControlEvent(TIMERA2_BASE,TIMER_BOTH,TIMER_EVENT_BOTH_EDGES);       //capture both edges in both timers
    TimerIntRegister(TIMERA2_BASE, TIMER_A, TimA2AIntHandler);
    TimerIntRegister(TIMERA2_BASE, TIMER_B, TimA2BIntHandler);
    TimerIntEnable(TIMERA2_BASE,TIMER_CAPA_EVENT|TIMER_CAPB_EVENT);      //INT capture event enable
    TimerControlStall(TIMERA2_BASE, TIMER_BOTH,true);
    TimerLoadSet(TIMERA2_BASE,TIMER_BOTH,0xffff);  //for T=209.7152 ms
}

void configTA3(void){
    TimerConfigure(TIMERA3_BASE,(TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_PWM | TIMER_CFG_B_PWM));
    TimerPrescaleSet(TIMERA3_BASE,TIMER_A,0x18);    //209.7152 ms max T,here 20ms
    TimerLoadSet(TIMERA3_BASE,TIMER_A,0x6a00); //20ms
    TimerMatchSet(TIMERA3_BASE, TIMER_A,((Period_ticks-outmatch)&0xffff));
    TimerPrescaleMatchSet(TIMERA3_BASE, TIMER_A,((Period_ticks-outmatch)&0xff0000)>>16);
    TimerPrescaleSet(TIMERA3_BASE,TIMER_B,0x18);    //209.7152 ms max T,here 20ms
    TimerLoadSet(TIMERA3_BASE,TIMER_B,0x69f0); //20ms
    TimerMatchSet(TIMERA3_BASE, TIMER_B,(Period_ticks-TICKS_FOR_3MS+outmatch)&0xffff);
    TimerPrescaleMatchSet(TIMERA3_BASE, TIMER_B,((Period_ticks-TICKS_FOR_3MS+outmatch)&0xff0000)>>16);
    //TimerControlStall(TIMERA3_BASE, TIMER_BOTH,true);

}
void adcSetup(void){
    // clear data
    while(ADCFIFOLvlGet(ADC_BASE, ADC_CH_3)) {
        ADCFIFORead(ADC_BASE, ADC_CH_3);}
// initialize ADC on channel 3 and 0
    ADCChannelEnable(ADC_BASE, ADC_CH_3);
    ADCTimerConfig(ADC_BASE,0x1ffff);  //or 20000?
    ADCTimerEnable(ADC_BASE);
    ADCEnable(ADC_BASE);
    ADCIntClear(ADC_BASE, ADC_CH_3,0xf);
    ADCIntEnable(ADC_BASE, ADC_CH_3,ADC_FIFO_FULL);
    ADCIntRegister(ADC_BASE, ADC_CH_3,adint3);
}
void myUartReport(void){

    UART_PRINT("Indeg=%3.3f\n\r",indeg[0]);
    UART_PRINT("Zrate=%3.3f\n\r",zrate[0]);
    UART_PRINT("P=%3.3f\n\r",P);
    UART_PRINT("D=%3.3f\n\r",D);
    UART_PRINT("Out=%3.3f\n\r",outMatchDeg);
}
float tdif(unsigned long int m){
    unsigned long h=0;
    float k;
    h=TimerValueGet(TIMERA1_BASE, TIMER_A);
    if(h<m){
        k=(m-h)*12.5/1000;
    }
    else{

    }
    return k;
}



//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************
void main()
{
    long lRetVal = -1;

    //
    // Board Initialization
    //
    BoardInit();


    //
    // Configure the pinmux settings for the peripherals exercised
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();
    //
    // I2C Init
    //
    I2C_IF_Open(I2C_MASTER_MODE_FST);

    InitializeAppVariables();

    //
    // Following function configure the device to default state by cleaning
    // the persistent settings stored in NVMEM (viz. connection profiles &
    // policies, power policy etc)
    //
    // Applications may choose to skip this step if the developer is sure
    // that the device is in its desired state at start of applicaton
    //
    // Note that all profiles and persistent settings that were done on the
    // device will be lost
    //
    lRetVal = ConfigureSimpleLinkToDefaultState();



    if(lRetVal < 0)
    {
        if (DEVICE_NOT_IN_STATION_MODE == lRetVal)
            UART_PRINT("Failed to configure the device in its default state \n\r");

        LOOP_FOREVER();
    }

    UART_PRINT("Device is configured in default state \n\r");


    //
    // Asumption is that the device is configured in station mode already
    // and it is in its default state
    //
    lRetVal = sl_Start(NULL,NULL,NULL); //here takes ~100ms...


    if (lRetVal < 0)
    {
        UART_PRINT("Failed to start the device \n\r");
        LOOP_FOREVER();
    }

    //UART_PRINT("Device started as STATION \n\r");

    //
    // Configure the networking mode and ssid name(for AP mode)
    //
    if(lRetVal != ROLE_AP)
    {
        if(ConfigureMode(lRetVal) != ROLE_AP)
        {
            UART_PRINT("Unable to set AP mode, exiting Application...\n\r");
            sl_Stop(SL_STOP_TIMEOUT);
            LOOP_FOREVER();
        }
    }


    while(!IS_IP_ACQUIRED(g_ulStatus))
    {
#ifndef SL_PLATFORM_MULTI_THREADED
      _SlNonOsMainLoopTask();
#endif
    }

    unsigned char len = sizeof(SlNetCfgIpV4Args_t);
    SlNetCfgIpV4Args_t ipV4 = {0};

    // get network configuration
    lRetVal = sl_NetCfgGet(SL_IPV4_AP_P2P_GO_GET_INFO,&ucDHCP,&len,
                            (unsigned char *)&ipV4);
    if (lRetVal < 0)
    {
        UART_PRINT("Failed to get network configuration \n\r");
        LOOP_FOREVER();
    }
    UART_PRINT("\n\rDevice IP: %d.%d.%d.%d\n\r\n\r",
                      SL_IPV4_BYTE(g_ulIpAddr,3),
                      SL_IPV4_BYTE(g_ulIpAddr,2),
                      SL_IPV4_BYTE(g_ulIpAddr,1),
                      SL_IPV4_BYTE(g_ulIpAddr,0));

    adcSetup();
    configTA2();        //timer for capture
    configTA3();        //timer for PWM signals

