alKallergis/CC3200-1-Axis-gyro-w-telemetry-UDP/USR 1-Axis gyro with telemetry udp VOLTAGE/main.c
    MAP_UtilsDelay(96000000);  //~6 s

    TimerEnable(TIMERA2_BASE,TIMER_BOTH);
    TimerEnable(TIMERA3_BASE,TIMER_BOTH);

    i2csetupAndTest();
    UDPTRANSMITSETUP(PORT_NUM);
    calculatecoefficients();
    while (1){
        #ifndef SL_PLATFORM_MULTI_THREADED
                      _SlNonOsMainLoopTask();
        #endif
        if(above){   //if slider is above threshold,

            IntDisable(INT_TIMERA2A);   //disable ints here because we need stable values
            IntDisable(INT_TIMERA2B);
            withinLoop=true;    //when we are within this loop,set flag for testing purposes
            indeg[1]=indeg[0];
            xrate[1]=xrate[0];    //shift values in fifo
            yrate[1]=yrate[0];
            zrate[1]=zrate[0];
            readI2Crates();     //read the rates from the gyro in deg/s
            P=Kp*(indeg[0]-zrate[0]);    //proportional term
            D=Kd*(indeg[0]-zrate[0]-indeg[1]+zrate[1])/40.0;   //differential
            outMatchDeg=P+D;
            outmatch=(outMatchDeg+1500)*80; //using the regular formula now
            withinLoop=false;
            IntEnable(INT_TIMERA2A);    //enable ints again,new values have been set
            IntEnable(INT_TIMERA2B);
        }

        //else{}   just pass latest input signal.already passed in last ta2a neg edge..
        if(udpSendCounter==transmissionPeriodPrescale){ //send data every 20*10=200ms
/*
            //32bit timer init for measuring...
            Timer_IF_Init(PRCM_TIMERA1, TIMERA1_BASE, TIMER_CFG_PERIODIC, TIMER_A, 0);
            TimerControlStall(TIMERA1_BASE, TIMER_A,true);  //enable timer stall on debug breakpoint
            TimerLoadSet(TIMERA1_BASE,TIMER_A,0xffffffff);
            TimerEnable(TIMERA1_BASE,TIMER_A);
            x=TimerValueGet(TIMERA1_BASE, TIMER_A); //time reference.warning this method of time measurement can be max ~55s
*/
            udpSendCounter=0;
            UDPTRANSMIT();
/*            y=tdif(x);  //us
            ms=y/1000;  //ms
            TimerDisable(TIMERA1_BASE,TIMER_A);*/

        }

        MAP_UtilsDelay(80/5);  //~1us

    }
    sl_Close(iSockID);
    UART_PRINT("Exiting Application ...\n\r");

    //
    // power off the network processor
    //
    lRetVal = sl_Stop(SL_STOP_TIMEOUT);
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
